console.log("🔸개요 및 프로젝트 시작🔸");
console.log("🔸🔸🔸🔸🔸🔸🔸🔸🔸🔸");

'▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️'

console.log("🔹🔹🔹정규식 생성🔹🔹🔹");
console.log("🔹🔹🔹🔹🔹🔹🔹🔹🔹🔹");

'▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️'

console.log("🔸🔸🔸🔸메소드🔸🔸🔸🔸");
console.log("🔸🔸🔸🔸🔸🔸🔸🔸🔸🔸");

'▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️'

console.log("🔹🔹🔹플래그(옵션)🔹🔹🔹");
console.log("🔹🔹🔹🔹🔹🔹🔹🔹🔹🔹");

'▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️'

console.log("🔸🔸 패턴(표현)(1) 🔸🔸");
console.log("🔸🔸🔸🔸🔸🔸🔸🔸🔸🔸");

'▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️'

console.log("🔹🔹 패턴(표현)(2) 🔹🔹");
console.log("🔹🔹🔹🔹🔹🔹🔹🔹🔹🔹");

'▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️▫️'